app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
     @articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_acticle
        @article = Article.find(params[:id])